Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་གཟུགས་གཉིས་སུ་མེད་པའི་མཚན་ཉིད་ལ་མཁས་ཤིང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་བར་དུ་དེ་ལྟར་གཉིས་སུ་མེད་པའི་མཚན་ཉིད་ལ་མཁས་པས་མཐའ་གཉིས་སྤངས་ནས་དབུ་མའི་ལམ་ལ་ཞུགས་པས་ཇི་ལྟར་མཚན་ཉིད་ཡོངས་སུ་ཤེས་པ་དང་།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, how should bodhisattvas who practice the perfection of wisdom, who are skilled in that manner in the nondual defining characteristics of physical forms, who have abandoned the two extremes, and who have embarked on the path of the middle way regard the comprehension of defining characteristics?

source: ཇི་ལྟར་མཚན་ཉིད་སྤང་བ་དང་།
en: How should they [regard] the abandoning of defining characteristics?

source: ཇི་ལྟར་མཚན་ཉིད་མངོན་དུ་བགྱི་བ་དང་།
en: How should they [regard] the actualizing of defining characteristics?

source: ཇི་ལྟར་མཚན་ཉིད་བསྒོམ་པ་བལྟ་བར་བགྱི། དེ་སྐད་གསོལ་བ་དང་།
en: How should they [regard] the cultivating of defining characteristics?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་བཀའ་སྩལ་པ། བྱམས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་གཉིས་སྤངས་ནས། དེ་ལྟར་དབུ་མའི་ལམ་ལ་རབ་ཏུ་ཞུགས་པས་གང་གཟུགས་ཡོངས་སུ་ཤེས་པ་ཡང་མ་ཡིན། ཡོངས་སུ་མི་ཤེས་པ་ཡང་མ་ཡིན་པ་དེ་ཉིད་དེའི་ཡོངས་སུ་ཤེས་པའོ།
en: The Blessed One replied to the bodhisattva Maitreya, “Maitreya, for bodhisattvas who practice the perfection of wisdom, who have abandoned the two extremes, and who have embarked on the path of the middle way, their comprehension with respect to these physical forms is just that there is neither comprehension nor noncomprehension.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་བར་དུ་གང་ཡོངས་སུ་ཤེས་པ་ཡང་མ་ཡིན། ཡོངས་སུ་མི་ཤེས་པ་ཡང་མ་ཡིན་པ་དེ་ཉིད་དེའི་ཡོངས་སུ་ཤེས་པའོ།
en: Similarly, their comprehension with respect to those feelings, perceptions, formative predispositions, consciousness and so forth, up to and including the qualities of the buddhas, is just that there is neither comprehension nor noncomprehension. {

source: །གང་གཟུགས་སྤོང་བ་ཡང་མ་ཡིན་མི་སྤོང་བ་ཡང་མ་ཡིན་པ་དེ་ཉིད་དེའི་སྤོང་བའོ།
en: Ki.VIII: 155} Their exertion with respect to these physical forms is just that there is neither exertion nor nonexertion.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་བར་དུ་གང་སྤོང་བ་ཡང་མ་ཡིན།
en: Similarly, their exertion with respect to those feelings, perceptions, formative predispositions, consciousness, and so forth, up to and including the attributes of the buddhas, is just that there is neither exertion nor nonexertion.

source: མི་སྤོང་བ་ཡང་མ་ཡིན་པ་དེ་ཉིད་དེའི་སྤོང་བའོ། །གང་གཟུགས་སྤོང་བ་མངོན་སུམ་དུ་བྱེད་པ་ཡང་མ་ཡིན་མངོན་སུམ་དུ་མི་བྱེད་པ་ཡང་མ་ཡིན་པ་དེ་ཉིད་དེའི་མངོན་སུམ་དུ་བྱེད་པའོ།
en: Their actualization with respect to the abandoning of those physical forms is just that there is neither actualization nor nonactualization.

source: །གང་གཟུགས་སྤོང་བའི་ལམ་སྒོམ་པ་ཡང་མ་ཡིན། མི་སྒོམ་པ་ཡང་མ་ཡིན་པ་དེ་ཉིད་དེའི་སྒོམ་པའོ།
en: Their cultivation with respect to the abandoning of those physical forms is just that there is neither cultivation nor noncultivation of the path. “

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་བར་དུ་སྦྱར་རོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: This [reasoning] should be similarly applied in the case of feelings, perceptions, formative predispositions, consciousness and so forth, up to and including the qualities of the buddhas.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཡོངས་སུ་ཤེས་པ་དང་། སྤོང་བ་དང་། མངོན་དུ་བྱེད་པ་དང་། བསྒོམ་པར་ལྡན་པ་དེའི་མྱ་ངན་ལས་འདས་པ་གང་ལགས།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, what is the nirvāṇa of bodhisattvas who practice the perfection of wisdom and are endowed with such comprehension, abandoning, actualization, and cultivation?” “

source: དེ་སྐད་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་བཀའ་སྩལ་པ། བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པ་ནི་ཟབ་བོ།
en: Maitreya, the nirvāṇa of the bodhisattvas is profound, very profound,” replied the Blessed One to the bodhisattva Maitreya.

source: །རབ་ཏུ་ཟབ་བོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པ་དེ་ལྟར་ཟབ་ཅིང་རབ་ཏུ་ཟབ་པ་ལགས།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, why is the nirvāṇa of the bodhisattvas profound, very profound?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པ་ནི་གང་མྱ་ངན་ལས་འདས་པ་ཡང་མ་ཡིན་མྱ་ངན་ལས་མ་འདས་པ་ཡང་མ་ཡིན་ཏེ།
en: Maitreya,” replied the Blessed One, “the nirvāṇa of the bodhisattvas is that which is neither nirvāṇa, nor not nirvāṇa.

source: དེ་བས་ན་དེ་ཟབ་ཅིང་རབ་ཏུ་ཟབ་ཅེས་བྱའོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: That is why it is profound, very profound.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པ་དེ་མྱ་ངན་ལས་འདས་པ་ཡང་མ་ལགས། མྱ་ངན་ལས་མ་འདས་པ་ཡང་མ་ལགས།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, in what way is the nirvāṇa of the bodhisattvas neither nirvāṇa, nor not nirvāṇa?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་པ་གཞན་གྱི་དོན་ལས་བརྩམས་ཏེ། འཁོར་བ་ཡོངས་སུ་མ་བཏང་བའི་ཕྱིར་མྱ་ངན་ལས་མ་འདས་པའོ།
en: Maitreya,” replied the Blessed One, “taking into account the benefit of others, it is not nirvāṇa because cyclic existence is not forsaken.

source: །བདག་གི་དོན་ལས་བརྩམས་ཏེ། མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་མ་བཏང་བའི་ཕྱིར་མྱ་ངན་ལས་འདས་པའོ།
en: Taking into account their own benefit, it is nirvāṇa because nirvāṇa is not forsaken.”

source: །དེ་སྐད་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱི་དོན་ལས་བརྩམས་ཏེ། འཁོར་བ་ཡོངས་སུ་མི་གཏོང་ན། འཁོར་བ་ཡོངས་སུ་མ་བཏང་བས་དེས་ཇི་ལྟར་མྱ་ངན་ལས་འདས་པ་བཏང་བར་མི་འགྱུར་རོ།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, taking into account the benefit of others, if bodhisattvas do not forsake cyclic existence, how through the nonforsaking of cyclic existence do they not also forsake nirvāṇa?

source: །བཅོམ་ལྡན་འདས་དེ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་དོན་ལས་བརྩམས་ཏེ། མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་མི་གཏོང་ན། དེས་ཇི་ལྟར་འཁོར་བ་ཡོངས་སུ་བཏང་བར་མི་འགྱུར།
en: Blessed Lord, taking into account their own benefit, if bodhisattvas do not forsake nirvāṇa, how do they not also forsake cyclic existence?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། འཁོར་བ་ལ་འཁོར་བར་རྣམ་པར་མི་རྟོག །མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མྱ་ངན་ལས་འདས་པར་རྣམ་པར་མི་རྟོག་སྟེ།
en: In this regard, Maitreya,” replied the Blessed One, “when bodhisattvas practice the perfection of wisdom, they do not conceptualize cyclic existence as cyclic existence, and they do not conceptualize nirvāṇa as nirvāṇa.

source: དེ་དེ་ལྟར་རྣམ་པར་མི་རྟོག་ན་འདི་ལྟར་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་གཉིས་མཚུངས་མཉམ་པར་འགྱུར་རོ།
en: When they do not conceptualize in that manner, cyclic existence and nirvāṇa both become the same. {Ki.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་འཁོར་བ་ལ་འཁོར་བར་རྣམ་པར་མི་རྟོག་ན་མྱ་ངན་ལས་འདས་པ་བཞིན་དུ་འཁོར་བར་མི་སྐྱོའོ།
en: VIII: 156} If you ask why, it is because when they do not conceptualize cyclic existence as cyclic existence, they do not become distressed in cyclic existence while they are in nirvāṇa.

source: །མྱ་ངན་ལས་འདས་པ་ལ་མྱ་ངན་ལས་འདས་པར་རྣམ་པར་མི་རྟོག་ན། འཁོར་བ་བཞིན་དུ་མྱ་ངན་ལས་འདས་པ་ལ་ཞེན་པར་མི་འགྱུར་རོ།
en: When they do not conceptualize nirvāṇa as nirvāṇa, they do not become attached to nirvāṇa while they are in cyclic existence.

source: །དེ་ལྟར་རྣམ་པར་མི་རྟོག་པའི་དབྱིངས་ལ་གནས་པ་དེ་རིགས་པ་འདིས་འཁོར་བ་ཡོངས་སུ་མི་གཏོང་བ་དང་། མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་མི་གཏོང་བར་རིག་པར་བྱའོ།
en: Therefore, you should know that for this reason, while established in the nonconceptual expanse, there is neither the forsaking of cyclic existence nor nonforsaking of nirvāṇa.”

source: །དེ་སྐད་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ། རྣམ་པར་མི་རྟོག་པའི་དབྱིངས་ལ་རབ་ཏུ་གནས་པས་ཇི་ལྟར་འཁོར་བ་མ་བཏང་བ་དེ་ལྟར་བླངས་པ་ཡང་མ་ལགས་སོ།
en: The bodhisattva Maitreya then said to the Blessed One, “Blessed Lord, just as bodhisattvas who practice the perfection of wisdom and are established in the nonconceptual expanse have not forsaken cyclic existence, they have indeed not appropriated it.

source: །མྱ་ངན་ལས་འདས་པ་ཇི་ལྟར་མ་བཏང་བ་དེ་ལྟར་བླངས་པ་ཡང་མ་ལགས་སོ།
en: Just as they have not forsaken nirvāṇa, they have indeed not appropriated that.

source: །བཅོམ་ལྡན་འདས་དེ་སྟེ་མ་བླངས་ན་ཇི་ལྟར་བཏང་བ་མ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if these have not been appropriated, how do they become something that has not been forsaken?” “

source: བྱམས་པ་ང་ནི་དེ་ལྟར་འཁོར་བ་བླང་བ་འམ། མི་བླང་བར་མི་སྨྲའི། བྱམས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་རྟོག་པའི་དབྱིངས་ལ་དམྱིགས་པའི་ཡེ་ཤེས་ཀྱིས་སེམས་དབང་དུ་གྱུར་པ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཐབས་མཁས་པས་འཁོར་བ་བསྟན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་འཁོར་བ་ཡོངས་སུ་མི་གཏོང་བར་ང་སྨྲའོ།
en: Maitreya,” replied the Blessed One, “I do not speak of the appropriation or nonappropriation of cyclic existence, but, Maitreya, I do say that bodhisattvas who practice the perfection of wisdom and have mastered their minds through the wisdom that has as its object the nonconceptual expanse, and bodhisattvas who have attained final nirvāṇa, do not forsake cyclic existence because they manifest in cyclic existence through skill in means, in all world systems of the ten directions, numerous as the grains of sand of the river Gaṅgā.

source: །སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པ་ལ་གནས་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཡོངས་སུ་མི་གཏོང་བར་ང་སྨྲའོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: I also say that they do not forsake nirvāṇa because they dwell in nonapprehensible emptiness.”

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་མི་རྟོག་པ་ལ་མཚན་ཉིད་ཐམས་ཅད་ཇི་ལྟར་བལྟ་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་པ་གཟུགས་གང་ཡིན་པ་དང་། ཚོར་བ་གང་ཡིན་པ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, how should all defining characteristics be regarded without conceptualizing?” “

source: རྣམ་པར་ཤེས་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་གང་ཡིན་པའི་བར་དང་། གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པའི་བར་དུ་ཆོས་དེ་དག་དང་སྟོང་པ་ཉིད་དེ་དག་སྒོམ་པ་དང་། དངོས་པོ་གཉིས་སུ་མེད་པ་དང་། རབ་ཏུ་སྤྲོས་པ་མེད་པ་འདི་ནི་བྱམས་པ་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཐམས་ཅད་དུ་བལྟའོ།
en: Maitreya,” replied the Blessed One, “through the nonduality of nonentities and entities, the absence of conceptual elaboration with respect to all phenomena and aspects of emptiness—that is to say, physical forms, feelings, perceptions, formative predispositions, consciousness and so forth, up to and including the qualities of the buddhas, along with the emptiness of physical forms and so forth, up to and including the emptiness of the qualities of the buddhas—Maitreya, the defining characteristics of all these phenomena should be regarded in that manner.”

source: །དེ་སྐད་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་ལགས། ཉན་ཐོས་ཐམས་ཅད་ཕྱོགས་གཅིག་པ་འམ། ཤིན་ཏུ་མྱ་ངན་ལས་འདས་པ་ལ་གནས་པ་ལགས།
en: The bodhisattva Maitreya then asked the Blessed One, “Blessed Lord, will all the śrāvakas be established in partial or complete nirvāṇa?” “

source: བྱམས་པ་དེ་ནི་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱམས་པ་འཇིག་རྟེན་པ་འདི་དག་ནི་ཁམས་སྣ་ཚོགས་པ་ཁམས་དུ་མ་པ་སྟེ།
en: If you ask why, Maitreya, the beings of these realms are of varied dispositions and manifold dispositions.

source: ཁམས་སྣ་ཚོགས་ཁམས་དུ་མ་པའི་འཇིག་རྟེན་པ་དེ་དག་ལ་སེམས་ཅན་གྱི་རིགས་དང་། རང་བཞིན་རབ་ཏུ་མང་པོ་ཡོད་དེ།
en: Among the beings of these realms with their varied dispositions and manifold dispositions there are beings of many sorts of heritage and nature.

source: བྱམས་པ་སེམས་ཅན་གྱི་རུས་དང་།
en: Maitreya, there are some among the classes and categories of beings {Ki.

source: རིགས་དང་པོ་ནས་བཟང་པོའི་ཁྱད་པར་འདོད་ཅིང་བཟང་པོའི་ཁྱད་པར་ཉིད་ཐོབ་པ་དེ་ལྟ་བུ་ཡང་ཡོད་དོ། །སེམས་ཅན་གྱི་རུས་དང་རིགས་གང་དང་པོ་ནས་ཁྱད་པར་ངན་པ་འདོད་ཅིང་ངན་པ་ཉིད་འཐོབ་སྟེ། དེ་ཉིད་ཀྱིས་མགུ་བར་འགྱུར་བ་དེ་ལྟ་བུ་ཡང་ཡོད་དོ།
en: VIII: 157} who from the beginning seek noble distinctions and who attain such noble distinctions, and there are some among the classes and categories of beings who from the beginning seek inferior distinctions and who will attain such inferior distinctions and rejoice in that.

source: །རུས་དང་རིགས་གང་ཐོག་མ་ནས་ངན་པའི་བྱེ་བྲག་འདོད་ཅིང་ངན་པ་ཉིད་འཐོབ་སྟེ། ངན་པ་ཐོབ་ནས་དེ་ཙམ་གྱིས་མགུ་བར་མི་འགྱུར་ཞིང་། དེ་ནས་ཕྱིས་གོང་དུ་བཟང་པོའི་ཁྱད་པར་འདོད་ཅིང་བཟང་པོ་འཐོབ་པར་འགྱུར་བ་དེ་ལྟ་བུ་དག་ཀྱང་ཡོད་དོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: There are also some among the classes and categories [of beings] who initially seek and attain inferior distinctions, but, having attained them, do not rejoice in merely that, and then later go on to seek higher, noble distinctions and attain such noble distinctions.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་སེམས་ཅན་གྱི་རུས་དང་རིགས་གསུམ་པོ་དེ་དགྲ་བཅོམ་པ་ཐོབ་ནས། བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་འཚལ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་སྐྱེ་བ་ཡང་མ་མཆིས་པར་ལུང་བསྟན་ཏེ།
en: The bodhisattva Maitreya then said to the Blessed One, “Blessed Lord, if that third class and category of beings, after attaining arhatship, should seek to attain unsurpassed, complete enlightenment, in that case, the Blessed One has prophesied that rebirth would be impossible for them.

source: སྐྱེ་བ་མ་མཆིས་ན་ཇི་ལྟར་འཐོབ་པར་འགྱུར།
en: If rebirth is impossible, how will they attain [enlightenment]?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་པ་དེའི་སྐྱེ་བ་ལས་དང་ཉོན་མོངས་པའི་དབང་དུ་གྱུར་པ་ཡིན་པར་ནི་ང་མི་འདོགས་ཀྱི། དེའི་སྐྱེ་བ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བར་གདགས་སོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: Maitreya,” replied the Blessed One, “I do not proclaim that they will acquire a rebirth under the sway of past actions and afflicted mental states, but I do proclaim that they will acquire the rebirth [of an arhat], attaining inconceivable nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་པ་རྒྱ་ཆེ་བ་དང་། ལྷག་པའི་བསམ་པ་མཐུ་ཆེ་བ་གང་ལ་དང་པོ་ཉིད་དུ་བཟང་པོའི་ཁྱད་པར་འཚལ་ཞིང་བཟང་པོའི་ཁྱད་པར་ཉིད་འཐོབ་པར་འགྱུར་བ་དེ་ངོ་མཚར་ཆེའོ།
en: The bodhisattva Maitreya then said to the Blessed One, “Blessed Lord, how wonderful it is that bodhisattva great beings who have magnanimous intentions and most powerful exalted aspirations seek noble distinctions from the very beginning and will attain such noble distinctions.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པ་རྒྱ་ཆེ་བ་དེ་དག་གང་ལགས།
en: Blessed Lord, what are these magnanimous intentions of bodhisattva great beings?” “

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལ་མ་ཆགས་པའི་བདེ་བ་དང་། མི་འཛིན་པའི་བདེ་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བདེ་བ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་བར་འདོད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་འདི་ལྟར་འཁོར་བ་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར་ཏེ།
en: Bodhisattvas dedicate the bliss of their nonattachment, the bliss of their nongrasping, and the bliss of their nirvāṇa to unsurpassed, complete enlightenment, seeking to make common cause with all beings.

source: འདི་ནི་དེ་དག་གི་ལྷག་པའི་བསམ་པ་མཐུ་ཆེན་པོ་ཡིན་པར་བལྟའོ།
en: It is because they do not forsake cyclic existence that this should be regarded as their magnanimous intention.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའོ།
en: The bodhisattva Maitreya then said to the Blessed One, “Blessed Lord, the Dharma of the bodhisattvas is wonderful and marvelous!

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བ་སྟེ།
en: The training of the bodhisattvas is wonderful and marvelous!

source: རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐོབ་པར་འཚལ་བས། བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ།
en: Noble sons and noble daughters who seek to attain this wonderful and marvelous Dharma of the bodhisattvas should set their minds on unsurpassed, complete enlightenment.”

source: །བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་རབ་ཏུ་ཕྱེ་བའི་ལེའུ་སྟེ། བདུན་ཅུ་གཉིས་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བདུན་ཅུ་བདུན་པ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས།
en: This completes the seventy-second chapter, “The Divisions of a Bodhisattva’s Training,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.” {

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཚོལ་འདོད་པའི་རིགས་ཀྱི་བུ་ཕོ་འམ། རིགས་ཀྱི་བུ་མོ་དེས་རྟག་པར་རབ་ཏུ་ངུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཇི་ལྟར་བཙལ་ཞིང་དེ་ལྟར་སྒྲ་དབྱངས་མི་ཟད་པར་སྒྲོགས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་དྲུང་ན། ཚངས་པར་སྤྱོད་པ་དེ་ལྟར་བཙལ་བར་བྱའོ། །དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: Va.238} Chapter 73: The Bodhisattva Sadāprarudita’s Attainment of the Manifold Gateways of Meditative Stability Then the Blessed One addressed the venerable Subhūti: “Subhūti, noble sons or noble daughters who search for this perfection of wisdom should search for it in the manner in which the bodhisattva great being Sadāprarudita (‘He Who Was Always Weeping’) searched, who [now] practices chastity in the presence of the tathāgata, arhat, completely awakened buddha named Bhīṣma­garjita­nirghoṣa­svara.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཇི་ལྟར་བཙལ། དེ་སྐད་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་བཀའ་སྩལ་ཏོ།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, how did the bodhisattva great being Sadāprarudita search for this perfection of wisdom?”

source: རབ་འབྱོར་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྔོན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚོལ་བ་ན། ལུས་མི་འཕངས་པ་དང་། སྲོག་ལ་མི་ལྟ་བ་དང་། རྙེད་པ་དང་བཀུར་བསྟི་དང་། གྲགས་པ་ལ་མི་གནས་པས་བཙལ་ཏོ།
en: The Blessed One replied to the venerable Subhūti, “Subhūti, when, in the past, the bodhisattva great being Sadāprarudita searched for the perfection of wisdom, he searched without caring for his body, considering his life, or being intent on gain, honor, or fame.

source: །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚོལ་བ་ན། དགོན་པ་ན་འདུག་པའི་ཚེ་བར་སྣང་ལས་འདི་སྐད་དུ་རིགས་ཀྱི་བུ་ཤར་ཕྱོགས་སུ་སོང་ཤིག་དང་། དེ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐོས་པར་འགྱུར་རོ། །ཅི་ནས་ཀྱང་ལུས་ངལ་བའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་།
en: While he was searching for the perfection of wisdom, he stayed in a wilderness, and at that time he heard a voice resounding from the air, saying, ‘Noble son, journey to the east and there you will hear the perfection of wisdom!

source: རྨུགས་པ་དང་གཉིད་ཀྱི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་། ཟས་ཀྱི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་། སྐོམ་གྱི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་། མཚན་མོའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་། ཉིན་པར་གྱི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་།
en: Come what may you should journey without paying attention to the weariness of your physical body, without paying attention to dullness and sleep, without paying attention to food, without paying attention to drink, without paying attention to night, without paying attention to day, without paying attention to cold, and without paying attention to heat.

source: གྲང་བའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དང་། ཚ་བ་ཡིད་ལ་བྱེད་པ་མི་སྐྱེ་བ་དེ་ལྟར་སོང་ཤིག། ཕྱི་རོལ་དང་ནང་གང་ལའང་སེམས་མ་འཇོག་ཤིག །
en: Do not let your mind settle on anything at all, inwardly or outwardly!

source: རིགས་ཀྱི་བུ་གཡོན་དུ་ལྟ་ཞིང་མ་འགྲོ་ཤིག།
en: Noble son, do not proceed while looking to the left!

source: གཡས་སུ་མ་ལྟ་ཞིག།
en: Do not look to the right!

source: ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བླ་དང་འོག་དང་མཚམས་རྣམས་སུ་ལྟ་ཞིང་མ་འགྲོ་ཤིག །
en: Do not proceed while looking to the west, the north, the zenith, the nadir, or the intermediate directions!

source: རིགས་ཀྱི་བུ་ཅི་ནས་ཀྱང་འཇིག་ཚོགས་ལ་མི་གཡོ་བ་དང་།
en: Noble son, by whatever means do not sway toward [false views about] perishable composites!

source: གཟུགས་ལ་མི་གཡོ་བ་དང་།
en: Do not sway toward physical forms!

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་གཡོ་བ་དེ་ལྟར་སོང་ཤིག།
en: Do not sway toward feelings, perceptions, formative predispositions, or consciousness! Proceed in that manner!

source: གང་དེས་གཡོས་པ་དེ་ནི་འགལ་བར་གནས་སོ།
en: Those who are swayed thereby are deviating.

source: །གང་ལས་འགལ་བར་གནས་ཤེ་ན། སངས་རྒྱས་ཀྱི་ཆོས་ལས་འགལ་བར་གནས་སོ།
en: If you ask from what they are deviating, they are deviating from the attributes of the buddhas.

source: །གང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་འགལ་བར་གནས་པ་དེ་འཁོར་བ་ན་སྤྱོད་དོ།
en: Those who deviate from the attributes of the buddhas roam in cyclic existence.

source: །གང་འཁོར་བ་ན་སྤྱོད་པ་དེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་རྙེད་དོ་ཞེས་ཟེར་བའི་སྒྲ་ཐོས་པར་གྱུར་ཏོ། །སྒྲ་དེས་དེ་སྐད་སྨྲས་པ་དང་།
en: Those who roam in cyclic existence do not find the perfection of wisdom!’ “

source: རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྒྲ་དེའི་ལན་འདི་སྐད་སྨྲས་སོ། །དེ་ལྟར་བྱའོ།
en: The bodhisattva great being Sadāprarudita replied to that voice, ‘I will do so!

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྣང་བ་བྱེད་པར་འདོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཆོས་བསྒྲུབ་པར་འདོད་པའི་ཕྱིར་རོ། །དེ་སྐད་སྨྲས་པ་དང་།
en: If you ask why, it is because I wish to illuminate all beings and wish to attain the attributes of the buddhas.’ “

source: སྒྲ་དེས་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་འདི་སྐད་སྨྲས་སོ། །རྟག་པར་རབ་ཏུ་ངུ་བའི་རིགས་ཀྱི་བུ་ལེགས་སོ།
en: The voice then said to the bodhisattva great being Sadāprarudita, ‘Excellent, Sadāprarudita, noble son!

source: །དེ་ནས་ཡང་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྟོང་པ་ཉིད་དང་།
en: Then again the bodhisattva great being Sadāprarudita heard the voice.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ལ་ཁྱོད་ཀྱིས་མོས་པ་བསྐྱེད་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཙལ་བར་བྱའོ།
en: It said, ‘You should search for the perfection of wisdom, believing in the attributes of the buddhas, which are emptiness, signlessness, and wishlessness!

source: །མཚན་མ་སྤངས་པ་དང་། དངོས་པོ་སྤངས་པ་དང་། སེམས་ཅན་དུ་ལྟ་བ་ཁྱོད་ཀྱིས་སྤང་བར་བྱའོ།
en: You should abandon signs, abandon entities, and abandon the false view that there are beings.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སྡིག་པའི་གྲོགས་པོ་རྣམས་སྤང་བར་བྱའོ། །གང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་།
en: Noble son, you should abandon evil associates!

source: མངོན་པར་འདུ་མི་བྱེད་པ་དང་། མ་བྱུང་བ་དང་། མ་སྐྱེས་པ་དང་། དངོས་པོ་མེད་པ་དང་། མ་འགགས་པའི་ཆོས་འཆད་པའི་དགེ་བའི་བཤེས་གཉེན་དག་བསྙེན་པར་བྱ།
en: You should venerate, serve, and respect spiritual mentors who teach emptiness, signlessness, and wishlessness, and [who teach that phenomena are without conditioning, unoriginated, nonarising, without entity, and unceasing. “ ‘

source: བསྟེན་པར་བྱ། བསྙེན་བཀུར་བྱའོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བྱས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གླེགས་བམ་དུ་གྱུར་པ་འམ། ཆོས་སྨྲ་བའི་དགེ་སློང་ལས་རིང་པོ་མི་ཐོགས་པར་ཐོས་པར་འགྱུར་རོ།
en: Noble son, if you act in that manner, you will before long hear the perfection of wisdom, either from a book or from a monk teaching the Dharma.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་གང་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཉན་པ་དེ་ལ་སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: Noble son, you should perceive as the Teacher the one from whom you hear the perfection of wisdom.
